#+title:     Filter contacts
#+author:    Logan Barnett
#+email:     logustus@gmail.com
#+date:      <2019-09-11 Wed>
#+language:  en
#+file_tags: contacts org-contacts mu
#+tags:

*** regex OR
    #+name: piped-names
    #+begin_src emacs-lisp :var names=filters[,0]
      (string-join names "|")
    #+end_src

    #+RESULTS: piped-names
    : billing|reply|offer|group|info|product|news|alert|receipt|reward|support|calendar|event|help|marketplace|notif|confirm

*** test with a count
    Run this one to get a count of the contacts after being filtered. This is a
    good test to see how well the match occurred.

    #+name: count-find-and-filter
    #+begin_src shell :noweb yes :var names=piped-names
      <<find-and-filter>> | wc -l
    #+end_src

    #+RESULTS: count-find-and-filter
    : 2223

*** test csv output
    #+name: test-find-and-filter
    #+begin_src shell :noweb yes :results value drawer
      <<find-and-filter>> | tail -n 12
    #+end_src

    #+RESULTS: test-find-and-filter
    :results:
    Warhammer Digital,digital@gwplc.com
    ,logan@battlementgames.com
    Jeremy Earl,mr_mooph@yahoo.com
    AT&T,att@e.att-mail.com
    Teri Summers,terisummers@cox.net
    ,LORIANN1969@gmail.com
    ,admin@atlantisremixed.org
    TechSmith,email@techsmith.messages4.com
    ChargePoint,driver-summary@chargepoint.com
    Adrian Cinta,adrian.cinta@gmail.com
    SmartCarry® the Invisible Holster,smartcarry@gmail.com
    Jim Owens,jimandfifi@cox.net
    :end:

    From here, the format appears as =<name>,<email>=, and =name= can be blank.
    Getting a blank =email= is nonsensical.

    The format I need to produce is like this:

    #+begin_src org
      ,* name
        :PROPERTIES:
        :EMAIL:    email
        :END:
    #+end_src

